public class 잃어버린강아지 {
    public int solution(int[][] board) {
        int answer = 0;
        int[] dx = {-1, 0, 1, 0}, dy = {0, 1, 0, -1};
        int x1 = 0, y1 = 0; // 현수 위치
        int x2 = 0, y2 = 0; // 강아지 위치
        int d1 = 0, d2 = 0; // 현수, 강아지 0인 이유는 문제에서 시작방향이 12시이기 때문이다.
        for (int i = 0; i < 10; i++) {
            for (int j = 0; j < 10; j++) {
                if (board[i][j] == 2) {
                    x1 = i;
                    y1 = j;
                }
                if (board[i][j] == 3) {
                    x2 = i;
                    y2 = j;
                }
            }

        }
        while (answer < 10000) {
            answer++;
            int nx1 = x1 + dx[d1], ny1 = y1 + dy[d1];
            int nx2 = x2 + dx[d2], ny2 = y2 + dy[d2];

            if (nx1 < 0 || nx1 >= 10 || ny1 < 0 || ny1 >= 10 || board[nx1][ny1] == 1) {
                d1 = (d1 + 1) % 4;
            }
            else {
                x1 = nx1;
                y1 = ny1;
            }
            if (nx2 < 0 || nx2 >= 10 || ny2 < 0 || ny2 >= 10 || board[nx2][ny2] == 1) {
                d2 = (d2 + 1) % 4;
            }
            else {
                x2 = nx2;
                y2 = ny2;
            }
            if (x1 == x2 && y1 == y2) {
                break;
            }
        }
        if (answer >= 10000) {
            return 0;
        }
        return answer;
    }

    public static void main(String[] args) {
        잃어버린강아지 T = new 잃어버린강아지();
        int[][] arr1 = {{0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
                {0, 0, 0, 0, 1, 0, 0, 0, 0, 0},
                {0, 0, 0, 1, 0, 0, 0, 1, 0, 0},
                {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {0, 0, 0, 1, 0, 0, 0, 2, 0, 0},
                {1, 0, 0, 0, 0, 0, 1, 0, 0, 0},
                {0, 0, 0, 1, 0, 0, 0, 0, 0, 0},
                {0, 0, 0, 0, 0, 3, 0, 0, 0, 1},
                {0, 0, 0, 1, 0, 1, 0, 0, 0, 0},
                {0, 1, 0, 1, 0, 0, 0, 0, 0, 0}};
        System.out.println(T.solution(arr1));
        int[][] arr2 = {{1, 0, 0, 0, 1, 0, 0, 0, 0, 0},
                {0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
                {0, 0, 1, 1, 0, 0, 0, 1, 0, 0},
                {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {0, 0, 0, 1, 0, 1, 0, 0, 0, 0},
                {1, 0, 0, 0, 0, 0, 1, 0, 1, 0},
                {0, 0, 0, 1, 0, 0, 0, 0, 0, 0},
                {0, 0, 1, 0, 0, 0, 0, 0, 2, 1},
                {0, 0, 0, 1, 0, 1, 0, 0, 0, 1},
                {0, 1, 0, 1, 0, 0, 0, 0, 0, 3}};
        System.out.println(T.solution(arr2));
    }
}
